import { useState } from "react";

import Title from "../../components/Titlecom/Title";

import Robot from '../../image/Questions/cute-ai-robot.svg'

import DropDown from '../../image/Questions/dropDown.svg'


const Answer = [
    {
        ques: "ما هو العمر المناسب لتعلم البرمجة؟",
        ans: "السر يكمن في استخدام لغة سهلة وممتعة حيث يستمتع الأطفال برحلة التعلم بشكل شيق مع لغة  `سكراتش جونيور` وهي تناسب الأطفال من سن ست سنوات و بغض النظر عن العمر، الحماس والفضول هما الدافعان الرئيسيان للطفل لكي يستمر في التعلم، انضموا إلينا وسنجعل رحلة تعلم البرمجة لأطفالكم تجربة رائعة وملهمة للغاية!"
    },
    {
        ques: "ما هو نظام تعليم البرمجة في ديجيتال مايند ؟",
        ans: "تهدف ديجيتال مايند إلى تعليم الأطفال من عمر 6 إلى 18 عام أساسيات ومباديء البرمجة ابتداءًا من المفاهيم البسيطة مثل: syntax, variables, data structures وتتابع رحلة تعليمهم حتى يصلوا إلى مرحلة متقدمة واحترافية يتعلمون فيها: polymorphism, concurrency وما إلى ذلك بإستخدام أدوات ولغات مثل: MIT Scratch, Unity, Unreal Engine."
    },
    {
        ques: "ما الذي يتعلمه الأطفال في رحلتهم التعليمية مع البرمجة؟",
        ans: "دورات البرمجة تعلم الطلاب كيفية التواصل بفعالية مع الكومبيوتر مما يمكنهم من إنشاء وتطوير مجموعة متنوعة من الإبداعات الرقمية مثل البرمجة والألعاب والبرامج والمواقع الإلكترونية والتطبيقات. نقدم في آي سكول رؤى قيمة حول استخدام لغات البرمجة مثل JavaScript و Python بالإضافة إلى استخدام أدوات تفاعلية مثل MIT Scratch، Unity، Unreal Engine، وغيرها."
    },
    {
        ques: "هل تطوير الألعاب جزء من البرمجة؟",
        ans: "بالطبع! تطوير الألعاب جزء أساسي من البرمجة، وهي واحدة من أكثر الطرق فعالية وتأثيرًا في تقديم البرمجة للأطفال، لن يتعلم طفلك فقط المهارات التقنية ولكنه سيتعلم أيضًا التفكير النقدي والتحليلي وكيفية حل المشكلات وسيصبح مبدع ومبتكر في المستقبل."
    },
    {
        ques: "هل البرمجة من المواد صعبة التعليم؟",
        ans: "تعلم البرمجة ليست بالمهمة الصعبة ويمكن للأطفال تعلم البرمجة في عمر ست سنوات، لكن الذي يحدد مدى سهولة رحلة التعلم هو جودة المدربين والمشاريع وطريقة التعلم، وتضمن مناهجنا للأطفال رحلة تعلم بسيطة وممتعة وتضمن تشكيل رؤية إبداعية لدى الأطفال."
    },
    {
        ques: "هل يستطيع طفل في عمر السادسة أن يكتب أكواد؟",
        ans: "يمكن للطفل في هذا العمر أن يتعلم مبادئ البرمجة وبعض المهارات المتعلقة بها، وهذا يمكنه من استيعاب معنى البرمجة ووضع أساسيات للتعلم وفي نفس الوقت يبدأ عقله في التطور والإبداع."
    },
    // {
    //     ques: "هل يمكنني تعلم البرمجة بنفسي؟",
    //     ans: "تختلف صعوبة تعلم البرمجة اعتمادًا على متى وأين وكيف تتعلم. ومع ذلك، من المهم التمييز بين مجرد معرفة الأساسيات والفهم الحقيقي واستخدام أفكار البرمجة العديدة التي تفتح الباب أمام إمكانيات لا حدود لها. تهدف ورش العمل لدينا إلى غرس تقدير الأطفال لجمال إنشاء برامجهم الخاصة، بالإضافة إلى تسليط الضوء على الإمكانيات غير المحدودة التي قد تفتحها خبرة البرمجة."
    // },
    // {
    //     ques: "كيف يتم شرح البرمجة للأطفال؟",
    //     ans: "نقوم بتعليم البرمجة للأطفال بطريقة سهلة وممتعة باستخدام الألعاب والأنشطة التفاعلية، نبدأ بمفاهيم بسيطة ونتقدم تدريجياً لمفاهيم أكثر تعقيدًا، الهدف هو جعل عملية التعلم مشوقة، حيث يستخدم الأطفال الألعاب والرسوم المتحركة لفهم البرمجة بشكل أفضل ونحرص على أن تكون رحلة تعليمهم معنا ممتعة وتفاعلية."
    // },
    // {
    //     ques: "كيف يمكنني تشجيع طفلي على تعلم البرمجة؟",
    //     ans: "عن طريق إضافة المرح والمتعة إلى رحلة التعلم، فيبدأ تعلم البرمجة عن طريق: الألعاب والرسوم المتحركة والموسيقى وأيضًا خلق عالم من القصص يشجعهم على التعلم، ونحن نهدف دائمًا إلى إلهام الأطفال والسماح لخيالهم بالإنطلاق مما يجعلهم يدرسون البرمجة بسهولة وسلاسة."
    // },
    // {
    //     ques: "هل يجب أن يكون الطفل متفوق في الرياضيات حتى يتمكن من استيعاب البرمجة؟",
    //     ans: "لا يجب أن يكون الطفل عبقريًا في الرياضيات حتى يفهم البرمجة بل أن تعلم البرمجة يساعد الطفل كثيرًا في دراسته الأكاديمية ويحسن من لغته الإنجليزية ومن مستواه في الرياضيات، ونحن نسعى دائمًا في آي سكول إلى تنمية مهارات الطفل وإلى تحسين علاقته بالدراسة والمواد التي يدرسها."
    // },
]






export default function Questions() {
    const [isopen, setisOpen] = useState(0)

    return (
        <section>
            <div className='w-[90%] lg:w-[80%] mx-auto h-full mt-10  '>
                <Title title={"أسئلة شائعة"} />

                <div className="md:flex justify-between items-center gap-4 mt-10">

                    <div className="w-[100%] h-[250px] md:hidden">
                        <img src={Robot} alt="Robot" className="w-[80%] md:w-full h-full hu__hu__ mx-auto" />
                    </div>

                    <div className="w-[100%] md:w-[80%] lg:w-[50%]">
                        {
                            Answer.map((item, index) => (
                                <div id="accordion-collapse" data-accordion="collapse" key={index}>
                                    <h2 id={`accordion-collapse-heading-${index}`} onClick={() => setisOpen(isopen === index ? null : index)}>
                                        <button
                                            type="button"
                                            className={`flex items-center justify-between w-full p-5 mb-2 font-medium text-gray-500 border border-gray-200 bg-white gap-3 ${isopen === index ? 'rounded-t-lg' : 'rounded-lg'
                                                }`}
                                            data-accordion-target={`#accordion-collapse-body-${index}`}
                                            aria-expanded={isopen === index}
                                            aria-controls={`accordion-collapse-body-${index}`}
                                        >
                                            {item.ques}
                                            <img src={DropDown} alt="dropdown icon" />
                                        </button>
                                    </h2>
                                    <div
                                        id={`accordion-collapse-body-${index}`}
                                        className={`${isopen === index ? 'block' : 'hidden'}`}
                                        aria-labelledby={`accordion-collapse-heading-${index}`}
                                    >
                                        <div className="p-5 border border-gray-200">
                                            <p className="mb-2 text-gray-500">{item.ans}</p>
                                        </div>
                                    </div>
                                </div>

                            ))
                        }
                    </div>

                    <div className="w-[450px] h-[450px] hidden md:block">
                        <img src={Robot} alt="Robot" className="w-[80%] md:w-full h-full hu__hu__ mx-0" />
                    </div>
                </div>
            </div>
        </section>
    )
}
